
# Дано ціле число n. Виведіть наступні значення для кожного цілого числа i від 1 до n:
#
# Десяткове
# Вісімкове
# Шістнадцяткове (у верхньому регістрі)
# Двійкове
#
# Опис функції
# Заповніть функцію print_formatted в редакторі нижче.
# print_formatted має наступні параметри:
#
# int number: максимальне значення для виведення
#
# Виведення
# Чотири значення повинні бути виведені в одному рядку у вказаному вище порядку для кожного i від 1 до number.
# Кожне значення повинно бути доповнене пробілами, щоб відповідати ширині двійкового значення number,
# і значення повинні бути розділені одним пробілом.
# Формат вводу
# Одне ціле число, що позначає n.
