#  "До календаря майже кожні чотири роки додається додатковий день, який припадає на 29 лютого,
#   і цей день називається високосним. Він виправляє календар за той факт, що наша планета обертається
#   навколо Сонця приблизно 365,25 днів. Високосний рік містить високосний день.
#
#   У григоріанському календарі для визначення високосних років використовуються три умови:
#
# Рік може бути рівно поділений на 4, тоді це високосний рік, якщо:
# Рік може бути рівно поділений на 100, тоді це НЕ високосний рік, якщо:
# Рік також рівно поділяється на 400. Тоді це високосний рік.
#   Це означає, що в григоріанському календарі роки 2000 і 2400 є високосними,
# тоді як 1800, 1900, 2100, 2200, 2300 і 2500 НЕ є високосними роками."
#
#   Тепер, щодо завдання: дано рік, визначте, чи є він високосним.
# Якщо це високосний рік, поверніть значення True, інакше поверніть False.
#
# Вхідні дані:
#
# Зчитайте рік, який потрібно перевірити.

# Обмеження: Відсутні.

# Формат виводу:
#
# Функція повинна повертати логічне значення (True/False). Вивід обробляється наданим кодом.

def is_leap(year):
    leap = False

# Write your logic here
    if year % 4 == 0:
        leap = True
    return leap


year = int(1990)
print(is_leap(year))
