
# Завдання
# Наданий фрагмент коду читатиметься в словнику,
# що містить пари ключ/значення, ім’я:[оцінки] для списку студентів.
# Надрукуйте середнє значення масиву оцінок для наданого імені студента, показуючи 2 знаки після коми.
#
# приклад
# позначає пари ключ:значення
# 'альфа': [20, 30, 40]
# 'бета': [30, 50, 70]
# query_name = 'бета'
# query_name є "бета". середній бал бета-версії становить
# (30+50+70)/3 = 50,0.
#
# Формат введення
#
# Перший рядок містить ціле число n — кількість записів студентів.
# Наступні n рядків містять імена та оцінки, отримані студентом,
# кожне значення розділене пробілом. Останній рядок містить query_name,
# ім’я студента, якого потрібно запитати.
#
# Формат виводу
#
# Виведіть один рядок: середнє значення балів, отриманих конкретним учнем, з точністю до 2 знаків після коми.
#
# Зразок введення 0
#
# 3
# Krishna 67 68 69
# Arjun 70 98 63
# Malika 52 56 60
# Malika
# Зразок результату 0
#
# 56,00
# Пояснення 0
#
# Оцінки для Malika: {52, 56, 60}, середнє значення яких дорівнює (52+56+60)/3 = 56
#
# Зразок введення 1
#
# 2
# Harsh 25 26.5 28
# Anurag 26 28 30
# Harsh
# Зразок результату 1
#
# 26.50


n = int(input('Введіть кількість судентів: '))
student_marks = {}

for _ in range(n):
    name, *line = input('Запишіть данні про студента, ім’я:[оцінки]: ').split()
    scores = list(map(float, line))
    student_marks[name] = scores
query_name = input('Введіть ім\'я студента що Вас цікавить: ')

for k, v in student_marks.items():
    if k == query_name:
        average_value = float(sum(v)/len(v))
        format_ave_val = "{:.2f}".format(average_value)
        print(format_ave_val)
