#
# Завдання
# Ініціалізуйте свій список і прочитайте значення [n], а потім [n] рядків команд,
# де кожна команда матиме 7 перелічених вище типів.
# Перегляньте кожну команду по порядку та виконайте відповідну операцію у своєму списку.
#
#
# Приклад
# N = 4
# додати 1
# додати 2
# вставити значення 3 за індексом 1
# друкувати
#
#
# append 1 : додати 1 до списку, arr = [1] .
# append 2 : додати 2 до списку, arr = [1, 2].
# insert 3 1: вставити 3 в індекс 1, arr = [1, 3, 2].
# print : надрукувати масив.
#
# Вихід:
# [1, 3, 2]
#
# Формат введення
#
# Перший рядок містить ціле число [n], що позначає кількість команд.
# Кожен рядок [i] з [n] наступних рядків містить одну з команд, описаних вище.

# Елементи, додані до списку, мають бути цілими числами.
#
# Формат виводу
# Для кожної команди типу print друкуйте список у новому рядку.
#
#
# Зразок введення 0
#
# 12
# insert 0 5
# insert 1 10
# insert 0 6
# print
# remove 6
# append 9
# append 1
# sort
# print
# pop
# reverse
# print
#
# Зразок результату 0
#
# [6, 5, 10]
# [1, 5, 9, 10]
# [9, 5, 1]

# ----------------------------------------------------------------------
# todo:Ви можете виконувати такі команди:
#
# todo:1. insert i e: вставити ціле число [e] у позицію [i].
# todo:2. print: надрукувати список.
# todo:3. remove e: видалити перше входження цілого числа за значенням [e].
# todo:4. append e: вставити ціле число [e] у кінець списку.
# todo:5. sort: сортування списку.
# todo:6. pop: видалити останній елемент зі списку.
# todo:7. reverse: Перевертання списку.


N = int(input('Введіть значення N: '))
arr = []

for _ in range(N):
    comand = input('Введіть comand: ').split()
    if comand[0] == 'insert':
        arr.insert(int(comand[1]), int(comand[2]))
    elif comand[0] == 'remove':
        arr.remove(int(comand[1]))
    elif comand[0] == 'append':
        arr.append(int(comand[1]))
    elif comand[0] == 'sort':
        arr.sort()
    elif comand[0] == 'pop':
        arr.pop()
    elif comand[0] == 'reverse':
        arr.reverse()
    elif comand[0] == 'print':
        print(arr)
