#
# Завдання
#
# Маючи ціле число n та n цілих чисел, розділених пробілами, на вхідних даних,
# створіть кортеж t з цих n цілих чисел. Потім обчисліть та надрукуйте результат hash(t).
# Примітка: hash() - одна з функцій у модулі builtins, тому її не потрібно імпортувати.
# Формат вхідних даних
# Перший рядок містить ціле число n, що позначає кількість елементів у кортежі.
# Другий рядок містить n цілих чисел, розділених пробілами, що описують елементи кортежу t.
# Формат вихідних даних
# Надрукуйте результат hash(t).
#
# Зразок вхідних даних 0
# 2
# 12
# Зразок вихідних даних 0
# 37130816315344100656

l_n = int(input('Введіть кількість елементів кортежу: '))
print(l_n)
n = input('Введіть через пробіл елементи кортежу: ').split()
print(n)

t = tuple(map(int, n))
print(t)

result = hash(t)
print(result)

